## Task 1. Create DataFrames

In [102]:
import pandas as pd

In [103]:
grades_dict = {'Wally': [87,96,70], 'Eva': [100,87,90], 'Sam': [94,77,90], 'Katie': [100,81,82],'Bob': [83,65,85]}

In [104]:
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2. Custom Index

In [105]:
grades.index = ['Test1', ' Test2', 'Test3']
grades

        Wally  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
 Test2     96   87   77     81   65
Test3      70   90   90     82   85

In [106]:
grades['Eva']

Test1     100
 Test2     87
Test3      90
Name: Eva, dtype: int64

In [107]:
grades.Katie

Test1     100
 Test2     81
Test3      82
Name: Katie, dtype: int64

## Task 3. Accessing Rows (loc,iloc)

In [108]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [109]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name:  Test2, dtype: int64

In [110]:
grades.iloc[2]

Wally    70
Eva      90
Sam      90
Katie    82
Bob      85
Name: Test3, dtype: int64

In [111]:
grades.loc['Test1':'Test3']

        Wally  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
 Test2     96   87   77     81   65
Test3      70   90   90     82   85

In [112]:
grades.iloc[0:2]

        Wally  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
 Test2     96   87   77     81   65

In [113]:
grades.loc[['Test1','Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [114]:
grades.iloc[[0,2]]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

## Task 3 Accessing Subsets (at,iat)

In [115]:
grades.at['Test1', 'Eva']

100

In [116]:
grades.iat[2,0]

70

## Task 4. Descrobe (By Column)

In [117]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [118]:
pd.set_option('display.precision', 2)

## Task 5. Transpose(rows <--> colums)

In [119]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [120]:
grades.T

       Test1   Test2  Test3
Wally     87      96     70
Eva      100      87     90
Sam       94      77     90
Katie    100      81     82
Bob       83      65     85

In [121]:
grades.T.describe

<bound method NDFrame.describe of        Test1   Test2  Test3
Wally     87      96     70
Eva      100      87     90
Sam       94      77     90
Katie    100      81     82
Bob       83      65     85>

In [122]:
grades.T.mean()

Test1     92.8
 Test2    81.2
Test3     83.4
dtype: float64

## Task 6. Sort

In [123]:
grades.sort_index(ascending=False)

        Wally  Eva  Sam  Katie  Bob
Test3      70   90   90     82   85
Test1      87  100   94    100   83
 Test2     96   87   77     81   65

In [124]:
grades.sort_index

<bound method DataFrame.sort_index of         Wally  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
 Test2     96   87   77     81   65
Test3      70   90   90     82   85>

In [125]:
grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test1    83  100    100   94     87
 Test2   65   87     81   77     96
Test3    85   90     82   90     70

In [126]:
grades.sort_values(by='Test1', axis=1, ascending=False)

        Eva  Katie  Sam  Wally  Bob
Test1   100    100   94     87   83
 Test2   87     81   77     96   65
Test3    90     82   90     70   85

In [127]:
grades.loc['Test1'].sort_values(ascending=False)

Eva      100
Katie    100
Sam       94
Wally     87
Bob       83
Name: Test1, dtype: int64